app/views/majors/index.html.erb


  Select a major: <%= select_tag :id, options_from_collection_for_select(Major.find(:all, :order => :name), :id, :name), {:onchange => "this.form.submit();", :include_blank => true } %>
---
SELECT "majors".* FROM "majors" WHERE "majors"."id" = ? LIMIT 1  [["id", "3"]]

      <tr>
        <% if (not @selected.courses.empty?) %>
---
SELECT "courses".* FROM "courses" INNER JOIN "requirements" ON "courses"."id" = "requirements"."course_id" WHERE "requirements"."major_id" = 2
SELECT COUNT(*) FROM "courses" INNER JOIN "requirements" ON "courses"."id" = "requirements"."course_id" WHERE "requirements"."major_id" = 4