app/controllers/majors_controller.rb

  def index
    @majors = Major.all
---
SELECT "majors".* FROM "majors" ORDER BY name

  def show
    @major = Major.find(params[:id])
---
SELECT "majors".* FROM "majors" WHERE "majors"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @major = Major.find(params[:id])
---
SELECT "majors".* FROM "majors" WHERE "majors"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @major = Major.new(params[:major])

    respond_to do |format|
      if @major.save
---
INSERT INTO "majors" ("created_at", "major", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 09 Feb 2013 16:18:39 UTC +00:00], ["major", "Basket waver"], ["updated_at", Sat, 09 Feb 2013 16:18:39 UTC +00:00]]

  def destroy
    @major = Major.find(params[:id])
    @major.destroy
---
SELECT "majors".* FROM "majors" WHERE "majors"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "majors" WHERE "majors"."id" = ?  [["id", 1]]